УТ.РасширениеКонтурЛогистика/src/InformationRegisters/КонтурЛогистика_НастройкиПодписания/КонтурЛогистика_НастройкиПодписания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_НастройкиПодписания</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>УдалитьОтпечатокСертификата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <comment>Используется только если не настроена должность в сертификате</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьДатаВыдачи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьСрокДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьМЧД</name>
    <comment>Единый регистрационный номер доверенности, Уникальный идентификатор доверенности в виде 36-разрядного GUID</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьИдСистХран</name>
    <comment>ИдСистХран - Идентифицирующие сведения об информационной системе, в которой хранится доверенность, используемая для подтверждения полномочий в электронной форме (СвСистХран для некоторых сообщений)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтатусПодписанта</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыПодписанта</types>
    </type>
  </resources>
  <resources>
    <name>СпосПодтПолном</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СпособыПодтвержденияПолномочий</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьОрганизация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьИздатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьДатаВыпускаМЧД</name>
    <comment>в драфте 5.02 более нет необходимости указывать дату доверки в титуле</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СвДоверБум_ДатаДовер</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СвДоверБум_ВнНомДовер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьОГРНИП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьТипМодуляКриптографии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьИмяМодуляКриптографии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>430</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьВводитьПарольВПрограммеЭлектроннойПодписи</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_СертификатыЭлектроннойПодписи</types>
    </type>
  </resources>
  <resources>
    <name>МЧД</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_МЧД</types>
    </type>
  </resources>
  <resources>
    <name>СтатусПроверки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СертификатБезМЧД</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДопСведенияОПодписанте</name>
    <comment>Дополнительные сведения о подписанте</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ПЗК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроверки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстСтатусаПроверки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОшибкиПроверки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>taskIdRegisterPOA</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПротоколВалидации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ОрганизацияДиадок</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь1С</name>
    <comment>не заполнен - общее значение для организации</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СертификатНаСервере</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДопПараметр</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_КлассификаторУпаковок</types>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
      <types>EnumRef.КонтурЛогистика_ТипыПрокси</types>
      <types>CatalogRef.ДополнительныеОтчетыИОбработки</types>
      <types>EnumRef.КонтурЛогистика_ЕдиницыИзмеренияГСМ</types>
      <types>EnumRef.КонтурЛогистика_ТипыЛогистическихДокументов</types>
      <types>CatalogRef.КонтурЛогистика_ГорючеСмазочныеМатериалы</types>
      <types>CatalogRef.КонтурЛогистика_Лицензии</types>
      <types>EnumRef.КонтурЛогистика_ТипыТранспортныхСредств</types>
      <types>EnumRef.КонтурЛогистика_ФункцииЗаказаЗаявки</types>
      <types>CatalogRef.Валюты</types>
      <types>EnumRef.КонтурЛогистика_МастерДанныеСотрудников</types>
      <types>CatalogRef.Контрагенты</types>
      <types>EnumRef.КонтурЛогистика_СпособыПередачиМЧД</types>
      <types>Boolean</types>
      <types>CatalogRef.КонтурЛогистика_ТранспортныеСредства</types>
      <types>EnumRef.КонтурЛогистика_ВидыПутейСообщений</types>
      <types>CatalogRef.КонтурЛогистика_СтраныМира</types>
      <types>EnumRef.КонтурЛогистика_ВариантыПроверкиПолномочийМЧД</types>
      <types>EnumRef.КонтурЛогистика_ВидыВладенияТранспортнымСредством</types>
      <types>CatalogRef.Организации</types>
      <types>EnumRef.КонтурЛогистика_МетодыОпределенияМассы</types>
      <types>EnumRef.КонтурЛогистика_ТипыПМ</types>
      <types>String</types>
      <types>CatalogRef.ДоговорыМеждуОрганизациями</types>
      <types>EnumRef.КонтурЛогистика_РежимыАвторизации</types>
      <types>CatalogRef.КонтурЛогистика_Договоры</types>
      <types>CatalogRef.Пользователи</types>
      <types>EnumRef.КонтурЛогистика_СпособыСопоставленияТоваровТитул3</types>
      <types>Date</types>
      <types>Number</types>
      <types>CatalogRef.ТранспортныеСредства</types>
      <types>CatalogRef.Партнеры</types>
      <types>EnumRef.КонтурЛогистика_СценарииПодписанияТитулов</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>EnumRef.КонтурЛогистика_ВариантыВалидации</types>
      <types>CatalogRef.КонтурЛогистика_ПунктыМаршрута</types>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.КонтурЛогистика_СостоянияДвиженияДокументооборота</types>
      <types>EnumRef.КонтурЛогистика_ТипыПоказанийТоплива</types>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      <types>CatalogRef.КонтурЛогистика_ПодразделенияДиадок</types>
      <types>EnumRef.КонтурЛогистика_ВидыПеревозки</types>
      <types>EnumRef.КонтурЛогистика_ТипыСопроводительныхДокументов</types>
      <types>EnumRef.КонтурЛогистика_ВидыКоммерческихПеревозок</types>
      <types>CatalogRef.ЗоныДоставки</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ.РасширениеКонтурЛогистика/src/Enums/КонтурЛогистика_СтатусыПодписанта/КонтурЛогистика_СтатусыПодписанта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_СтатусыПодписанта</name>
  <enumValues>
    <name>_1</name>
  </enumValues>
  <enumValues>
    <name>_2</name>
  </enumValues>
  <enumValues>
    <name>_3</name>
  </enumValues>
  <enumValues>
    <name>_4</name>
  </enumValues>
  <enumValues>
    <name>_5</name>
  </enumValues>
  <enumValues>
    <name>_6</name>
  </enumValues>
</mdclass:Enum>

УТ.РасширениеКонтурЛогистика/src/Enums/КонтурЛогистика_ТипыЛиц/КонтурЛогистика_ТипыЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ТипыЛиц</name>
  <enumValues>
    <name>ИП</name>
  </enumValues>
  <enumValues>
    <name>ЮрЛицо</name>
  </enumValues>
  <enumValues>
    <name>ФизЛицо</name>
  </enumValues>
  <enumValues>
    <name>ИностранныйЮрЛицо</name>
  </enumValues>
  <enumValues>
    <name>ИностранныйФизЛицо</name>
  </enumValues>
  <enumValues>
    <name>ОрганИсполнительнойВласти</name>
  </enumValues>
</mdclass:Enum>

УТ.РасширениеКонтурЛогистика/src/InformationRegisters/КонтурЛогистика_НастройкиПодписания/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользоватьКриптографию1С = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользоватьКриптографию1С");
	ЭтоНовый = Не ЗначениеЗаполнено(Запись.ИсходныйКлючЗаписи.Период);
	
	Если Параметры.Свойство("Сертификат") Тогда
		
		Запись.Сертификат = Параметры.Сертификат;
		
	КонецЕсли;
	
	ИспользоватьСертификат = ЗначениеЗаполнено(Запись.Сертификат) Или ЭтоНовый;
	
	Если ЭтоНовый Тогда
		Запись.Период = НачалоДня(Запись.Период);
	КонецЕсли;
	
	// обычный пользователь не модифицирует существующие записи совсем
	ТекПользовательПродвинутый = (КонтурЛогистика_ОбщегоНазначенияСервер.ТекПользовательАдминистратор()
		Или РольДоступна("КонтурЛогистика_НастройкаПодписания"));
	Если Не ТекПользовательПродвинутый И Не ЭтоНовый Тогда 
		
		ЭтаФорма.ТолькоПросмотр = Истина;
		Элементы.ВыбратьСертификат.Доступность = Ложь;
		Элементы.ИспользоватьСертификат.Доступность = Ложь;
		
	КонецЕсли;
	
	// обычный и продвинутый пользователь не могут указывать только себя 
	
	Если Не ТекПользовательПродвинутый И Не ЭтоНовый Тогда
		
		Элементы.Пользователь1С.Доступность = Ложь;
		
	КонецЕсли;
		
	Если Не ТекПользовательПродвинутый И ЭтоНовый Тогда
		
		Элементы.Пользователь1С.Доступность = Ложь;
		Запись.Пользователь1С = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПолучитьТекущегоПользователя1С();
		
	КонецЕсли;
	
	Если Не ТекПользовательПродвинутый Тогда
		
		Элементы.Пользователь1С.Доступность = Ложь;
		
		Если ЭтоНовый Тогда 
			
			Запись.Пользователь1С = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПолучитьТекущегоПользователя1С();
			
		ИначеЕсли Запись.Пользователь1С <> КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПолучитьТекущегоПользователя1С() Тогда 
				
				ЭтаФорма.ТолькоПросмотр = Истина;
				Элементы.ВыбратьСертификат.Доступность = Ложь;
				Элементы.ИспользоватьСертификат.Доступность = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ВалидацияМЧД();
				
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеЭлементамиФормы(ЭтаФорма);
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("КонтурЛогистика_ПерепроверитьДокумент");
	Оповестить("КонтурЛогистика_ОбновитьФормуПроверкиСертификатов");
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьСертификат(Команда)
	
	 КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		 "ОбщаяФорма.КонтурЛогистика_ВыборСертификата",
		 ,
		 ЭтаФорма,
		 ЭтаФорма,
		 "ОбработчикВыборСертификата");
	 
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВыборСертификата(ДанныеСертификата, ДопПараметры = Неопределено) Экспорт

	Если ДанныеСертификата <> Неопределено Тогда
		
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЗаполнитьСертификатДанными(Запись, ДанныеСертификата);
		
		// определяем тип модуля криптографии
		#Если ВебКлиент Тогда
		
			ЗаполнитьТипПрограммыЭППоУмолчанию();
			
			Элементы.ПредупреждениеГруппа.Видимость = Истина;
			Элементы.Предупреждение.Заголовок = "После выбора сертификата рекомендуется выполнить проверку сертификата";
			
		#КонецЕсли
		
	КонецЕсли;
	
	УправлениеЭлементамиФормы(ЭтаФорма);
		
КонецПроцедуры

&НаКлиенте
Процедура УбратьАвторизацию() Экспорт	
			
	Элементы.ПроверитьАвторизацию.Видимость = Ложь;	
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УсловноеОформлениеПредставленияПЗК(Форма)
	
	Если Форма.Запись.ВводитьПарольВПрограммеЭлектроннойПодписи Тогда		
		Форма.Запись.ПЗК = "";
		Форма.Элементы.ПредставлениеПЗК.Доступность = Ложь;				
	Иначе		
		Форма.Элементы.ПредставлениеПЗК.Доступность = Истина;		
	КонецЕсли;
	
	Форма.ПредставлениеПЗК = ?(ЗначениеЗаполнено(Форма.Запись.ПЗК), "Изменить", "Ввести");
	
	#Если ВебКлиент Тогда
		Форма.Элементы.ПредставлениеПЗК.Видимость = ЗначениеЗаполнено(Форма.Запись.ОтпечатокСертификата);	
	#Иначе
		Форма.Элементы.ПредставлениеПЗК.Видимость = Форма.ИспользоватьКриптографию1С И ЗначениеЗаполнено(Форма.Запись.ОтпечатокСертификата);
	#КонецЕсли
		
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПЗКНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура("ДанныеСертификата", КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ОписаниеДанныхСертификата());
	ЗаполнитьЗначенияСвойств(ПараметрыФормы.ДанныеСертификата, Запись);
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		 "ОбщаяФорма.КонтурЛогистика_ВводПЗК",
		 ПараметрыФормы,
		 ЭтаФорма,
		 ЭтаФорма,
		 "ОбработчикВводаПЗК");
	
КонецПроцедуры

&НаКлиенте
Процедура ПопытатьсяАвторизоваться()
	
	Если Не ИспользоватьКриптографию1С Тогда 
					
		ПЗК = ?(ЗначениеЗаполнено(Запись.ПЗК), Запись.ПЗК, Неопределено);
		
		Попытка
			
			Если Не Запись.СертификатНаСервере Тогда 	
				Авторизация_ПоСертификату(Запись.ОтпечатокСертификата, ПЗК);			
			Иначе				
				Авторизация_ПоСертификатуНаСервере(Запись.ОтпечатокСертификата, ПЗК);		
			КонецЕсли;
			
		Исключение
			
			ДобавитьОшибкуАвторизации(Запись.ОтпечатокСертификата, ИнформацияОбОшибке()); 
			
			ОбработкаОшибокАвторизацииПоСертификатам();
			
		КонецПопытки;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВводаПЗК(Результат, ДопПараметры = Неопределено) Экспорт 
	
	Если Результат = Неопределено Тогда
		Сообщить("Пароль закрытого ключа сертификата не изменен");
		Возврат
	КонецЕсли;
	
	Запись.ПЗК = Результат;
	
	#Если Не Вебклиент Тогда
		ПопытатьсяАвторизоваться();
	#КонецЕсли	
	
	УсловноеОформлениеПредставленияПЗК(ЭтаФорма);
	
	Модифицированность = Истина;
	
КонецПроцедуры	

&НаКлиенте
Функция ДанныеСертификата(ДанныеТекущейСтроки)

	ДанныеСертификата = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ОписаниеДанныхСертификата();
	ЗаполнитьЗначенияСвойств(ДанныеСертификата, ДанныеТекущейСтроки);
	
	Возврат ДанныеСертификата;

КонецФункции

&НаКлиенте
Функция Авторизация_ПоСертификату(ОтпечатокСертификата, ПЗК)
	
	Возврат Модуль_ЯдроНаКлиенте().Авторизация_ПоСертификату(ОтпечатокСертификата, ПЗК);
		
КонецФункции

&НаСервереБезКонтекста
Функция Авторизация_ПоСертификатуНаСервере(ОтпечатокСертификата, ПЗК)
		
	Возврат Модуль_ЯдроНаСервере().Авторизация_ПоСертификату(ОтпечатокСертификата, ПЗК);
	
КонецФункции

&НаКлиенте
Функция Модуль_ЯдроНаКлиенте()

	Возврат КонтурЛогистика_ИнтеграцияДиадокКлиентПовтИсп.ЯдроНаКлиенте();	

КонецФункции

&НаСервереБезКонтекста
Функция Модуль_ЯдроНаСервере()

	Возврат КонтурЛогистика_ИнтеграцияДиадокСерверПовтИсп.Ядро();	

КонецФункции 

&НаКлиенте
Процедура ДобавитьОшибкуАвторизации(ОтпечатокСертификата ,ИнформацияОбОшибке)
	
	ОшибкаАвторизации = Новый Структура;
		
	ОшибкаАвторизации.Вставить("ОтпечатокСертификата", "ОтпечатокСертификата");
	ОшибкаАвторизации.Вставить("ИнформацияОбОшибке", ИнформацияОбОшибке);

КонецПроцедуры

//Обрабатывает ошибки возникающие при авторизации по сертификату, выводит сообщение пользователю что авторизация не прошла
//
// Параметры:
//  ОшибкиАвторизации - Массив структур описывающих ошибки подключения
//   *ОтпечатокСертификата			 - Строка				 - отпечаток сертификата
//   *ИнформацияОбОшибке			 - ИнформацияОбОшибке	 - ИнформацияОбОшибке()
//
&НаКлиенте
Процедура ОбработкаОшибокАвторизацииПоСертификатам()
	
	Если ТипЗнч(ОшибкаАвторизации) = Тип("Структура") И ОшибкаАвторизации.Количество() > 0 Тогда
			
		ИдентификаторОшибки = "";
		
		Если ТипЗнч(ОшибкаАвторизации.ИнформацияОбОшибке) = Тип("ИнформацияОбОшибке") Тогда 
		
			ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ОшибкаАвторизации.ИнформацияОбОшибке);
			
			Если Найти(ПодробноеПредставлениеОшибки, "401") И Найти(ПодробноеПредставлениеОшибки, "is not authorized") Тогда
				ИдентификаторОшибки = "Сертификат не имеет доступа в Диадок";
			ИначеЕсли Найти(ПодробноеПредставлениеОшибки, "0x80090022") Тогда 	
				ИдентификаторОшибки = "Provider could not perform the action since the context was acquired as silent.";
			Иначе
				
				Если ОшибкаАвторизации.ИнформацияОбОшибке.Причина = Неопределено Тогда
					ОписаниеОшибки = ОшибкаАвторизации.ИнформацияОбОшибке.Описание;
				Иначе
					ОписаниеОшибки = ОшибкаАвторизации.ИнформацияОбОшибке.Причина.Описание;
				КонецЕсли;
				
				ИдентификаторОшибки = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(
					"Не удалось авторизоваться по сертификату:
					|%1" + Символы.ПС,
					ОписаниеОшибки);
				
			КонецЕсли;
		
		Иначе
			
			ИдентификаторОшибки = ОшибкаАвторизации.ИнформацияОбОшибке;
			
		КонецЕсли;
				
		ШаблонОшибки = "%1
						|Попробуйте авторизироватьсся в веб-версии
						|или обратитесь в техподдержку";
	
		ТекстОшибки = КонтурЛогистика_ИнтеграцияДиадокКлиентПовтИсп.ЯдроНаКлиенте().Общее_ПодставитьПараметрыВСтроку(ШаблонОшибки, ИдентификаторОшибки);
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика(ТекстОшибки);
		
	КонецЕсли;
	
	ОшибкаАвторизации = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Не ЗначениеЗаполнено(Запись.Сертификат) И ИспользоватьСертификат Тогда 
		Сообщить("Укажите Сертификат");
		Отказ = Истина;
	ИначеЕсли Не ИспользоватьСертификат Тогда
		
		Если Не ЗначениеЗаполнено(Запись.Фамилия) Тогда
			Сообщить("Укажите Фамилия");
			Отказ = Истина;	
		КонецЕсли;		
		Если Не ЗначениеЗаполнено(Запись.Имя) Тогда
			Сообщить("Укажите Имя");
			Отказ = Истина;	
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Запись.Должность) Тогда
			Сообщить("Укажите Должность");
			Отказ = Истина;	
		КонецЕсли;
				
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Запись.СтатусПодписанта) Тогда 
		Сообщить("Укажите Статус подписанта");
		Отказ = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Запись.МЧД) Тогда
		Запись.ПротоколВалидации = "";
	КонецЕсли;
	
	Если ИспользоватьСертификат 
		И ЗначениеЗаполнено(Запись.Сертификат) 
		И (Запись.СтатусПодписанта = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыПодписанта._2")
			ИЛИ Запись.СтатусПодписанта = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыПодписанта._5")
			ИЛИ Запись.СпосПодтПолном = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СпособыПодтвержденияПолномочий._3"))
		И Не ЗначениеЗаполнено(Запись.МЧД) Тогда
		Сообщить("Укажите МЧД");
		Отказ = Истина;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеЭлементамиФормы(Форма)
	
	ВыбранСертификат = ЗначениеЗаполнено(Запись.Сертификат);
	
	Элементы.ГруппаНетСертификата.Видимость = Не ИспользоватьСертификат;
	Элементы.ГруппаСертификат.Видимость = ИспользоватьСертификат;
	
	Элементы.ГруппаМЧД.Видимость = 
		ИспользоватьСертификат 
		И ВыбранСертификат 
		И (Запись.СтатусПодписанта = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыПодписанта._2")
			ИЛИ Запись.СтатусПодписанта = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыПодписанта._5")
			ИЛИ Запись.СпосПодтПолном = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СпособыПодтвержденияПолномочий._3"));
	
	Если Запись.СпосПодтПолном = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СпособыПодтвержденияПолномочий._5")
		Или Запись.СтатусПодписанта = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыПодписанта._3")
		Или Запись.СтатусПодписанта = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыПодписанта._6") Тогда
		
		Элементы.ГруппаБумажнаяДоверенность.Видимость = Истина;
	Иначе
		Элементы.ГруппаБумажнаяДоверенность.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.СтатусПодписанта.Видимость = ЗначениеЗаполнено(Запись.Сертификат);
	Элементы.СпосПодтПолном.Видимость = ЗначениеЗаполнено(Запись.Сертификат);
	
	УправлениеПодсказкойПериода();
	
	ОтобразитьГруппуПроверкиМЧД();
	
	УправлениеОтображениемВалидацииМЧД();
			
КонецПроцедуры

&НаКлиенте
Процедура УправлениеПодсказкойПериода()
	
	Если Запись.Период <> НачалоДня(Запись.Период) И Запись.Период > НачалоДня(ТекущаяДата()) Тогда
		Элементы.ПериодВремя.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСправа;
		Элементы.ПериодВремя.Подсказка = "Настройка начнет действовать с " + Формат(Запись.Период + 60 * 60 * 24, "ДФ='dd.MM.yyyy'");
	Иначе
		Элементы.ПериодВремя.ОтображениеПодсказки = ОтображениеПодсказки.Кнопка;
		Элементы.ПериодВремя.Подсказка = "Можно настроить настроить начало использования сертификатов в будущем";
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьСертификатПриИзменении(Элемент)
	
	ЗаполнитьЗначенияСвойств(Запись, КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ОписаниеДанныхСертификата());
	
	УправлениеЭлементамиФормы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусПодписантаПриИзменении(Элемент)
	
	Запись.МЧД = "";
	Запись.ПротоколВалидации = "";
	
	ВалидацияМЧД();
	УправлениеЭлементамиФормы(ЭтаФорма);
		
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьАвторизацию(Команда)
	
	ПопытатьсяАвторизоваться();
	
КонецПроцедуры

&НаКлиенте
Процедура СпосПодтПолномПриИзменении(Элемент)
	ВалидацияМЧД();
	УправлениеЭлементамиФормы(ЭтаФорма)
КонецПроцедуры

&НаКлиенте
Процедура ПериодВремяПриИзменении(Элемент)
	
	УправлениеПодсказкойПериода();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	УправлениеПодсказкойПериода();
	
КонецПроцедуры

#Область Сертификат

&НаКлиенте
Процедура СертификатПриИзменении(Элемент)
	
	Организация = КонтурЛогистика_ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта_КонтурЛогистика(Запись.Сертификат, "Организация");
	
	Если ЗначениеЗаполнено(Организация) Тогда 
		Запись.СтатусПодписанта = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыПодписанта._1");
		Запись.СпосПодтПолном = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СпособыПодтвержденияПолномочий._1");
	Иначе
		Запись.СтатусПодписанта = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыПодписанта._2");
		Запись.СпосПодтПолном = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СпособыПодтвержденияПолномочий._3");
	КонецЕсли;
	
	Запись.СертификатНаСервере = КонтурЛогистика_ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта_КонтурЛогистика(Запись.Сертификат, "СертификатНаСервере");
	
	ОчиститьРеквизитыПроверкиМЧД();
	
	ВалидацияМЧД();	
	УправлениеЭлементамиФормы(ЭтаФорма);
    	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ВалидацияМЧД()

	ТекстВалидации = "";
	ОшибкиВалидации = "";
	Запись.СертификатБезМЧД = Ложь;
	
	Если ЗначениеЗаполнено(Запись.Сертификат) И ЗначениеЗаполнено(Запись.ОрганизацияДиадок) И Не ЗначениеЗаполнено(Запись.МЧД)
		И (Запись.СтатусПодписанта = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыПодписанта._1")
			ИЛИ Запись.СтатусПодписанта = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыПодписанта._2")
			ИЛИ Запись.СтатусПодписанта = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыПодписанта._4")
			ИЛИ Запись.СтатусПодписанта = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыПодписанта._5")
			ИЛИ Запись.СпосПодтПолном = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СпособыПодтвержденияПолномочий._2")
			ИЛИ Запись.СпосПодтПолном = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СпособыПодтвержденияПолномочий._3")) Тогда
			
		ТекстВалидации = "Без МЧД подпись юридически не значима. Выберите МЧД";
		ОшибкиВалидации = "";
		
		СертификатВыдан = Справочники.КонтурЛогистика_СертификатыЭлектроннойПодписи.ТипВладельцаСертификата(Запись.Сертификат);
		
		Если Запись.ОрганизацияДиадок.ТипЛица = Перечисления.КонтурЛогистика_ТипыЛиц.ЮрЛицо И СертификатВыдан = Перечисления.КонтурЛогистика_ТипыЛиц.ФизЛицо Тогда
			
			ОшибкиВалидации = "Для организации с типом юридическое лицо выбран сертификат физического лица";
						
		ИначеЕсли Запись.ОрганизацияДиадок.ТипЛица = Перечисления.КонтурЛогистика_ТипыЛиц.ЮрЛицо Тогда
			
			Если ЗначениеЗаполнено(Запись.ОрганизацияДиадок.ИНН) И ЗначениеЗаполнено(Запись.Сертификат.ИННЮЛ) 
				И Запись.ОрганизацияДиадок.ИНН <> Запись.Сертификат.ИННЮЛ Тогда
				
				ОшибкиВалидации = "ИНН организации не совпадает с ИНН сертификата";				
				
			КонецЕсли;
			
		ИначеЕсли Запись.ОрганизацияДиадок.ТипЛица = Перечисления.КонтурЛогистика_ТипыЛиц.ИП Тогда
			
			Если ЗначениеЗаполнено(Запись.ОрганизацияДиадок.ОГРН) И ЗначениеЗаполнено(Запись.Сертификат.ОГРНИП) 
				И Запись.ОрганизацияДиадок.ОГРН <> Запись.Сертификат.ОГРНИП Тогда
				
				ОшибкиВалидации = "ОГРНИП организации не совпадает с ОГРНИП сертификата";
				
			ИначеЕсли ЗначениеЗаполнено(Запись.ОрганизацияДиадок.СНИЛС) И ЗначениеЗаполнено(Запись.Сертификат.СНИЛС) 
				И Запись.ОрганизацияДиадок.СНИЛС <> Запись.Сертификат.СНИЛС Тогда
				
				ОшибкиВалидации = "СНИЛС организации не совпадает с СНИЛС сертификата";
				
			ИначеЕсли Запись.ОрганизацияДиадок.Фамилия <> Запись.Сертификат.Фамилия 
				И Запись.ОрганизацияДиадок.Имя <> Запись.Сертификат.Фамилия
				И Запись.ОрганизацияДиадок.Отчество <> Запись.Сертификат.Фамилия Тогда
				
				ОшибкиВалидации = "ФИО физического лица не совпадает с ФИО сертификата";
				
			КонецЕсли;
		
		ИначеЕсли Запись.ОрганизацияДиадок.ТипЛица = Перечисления.КонтурЛогистика_ТипыЛиц.ФизЛицо Тогда
			
			Если ЗначениеЗаполнено(Запись.ОрганизацияДиадок.СНИЛС) И ЗначениеЗаполнено(Запись.Сертификат.СНИЛС) 
				И Запись.ОрганизацияДиадок.СНИЛС <> Запись.Сертификат.СНИЛС Тогда
				
				ОшибкиВалидации = "СНИЛС организации не совпадает с СНИЛС сертификата";
				
			ИначеЕсли Запись.ОрганизацияДиадок.Фамилия <> Запись.Сертификат.Фамилия 
				И Запись.ОрганизацияДиадок.Имя <> Запись.Сертификат.Фамилия
				И Запись.ОрганизацияДиадок.Отчество <> Запись.Сертификат.Фамилия Тогда
				
				ОшибкиВалидации = "ФИО физического лица не совпадает с ФИО сертификата";
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОшибкиВалидации) Тогда
		Запись.СертификатБезМЧД = Истина;
	КонецЕсли;
					
КонецПроцедуры

&НаКлиенте
Процедура УправлениеОтображениемВалидацииМЧД()
	
	Элементы.ГруппаВалидацияМЧД.Видимость = ЗначениеЗаполнено(ОшибкиВалидации); 
	Элементы.ПоказатьОшибкиВалидации.Видимость = ЗначениеЗаполнено(ОшибкиВалидации);
	
	Элементы.ТекстВалидация.Заголовок = ТекстВалидации;
			
КонецПроцедуры

#Область ПроверкаСертификата

&НаКлиенте
Процедура ЗаполнитьСписокТиповМодуляКриптографииДляВыбора()
	
	ТипыМодуляКриптографииДляВыбора = Новый Массив;
	ТипыМодуляКриптографии = КонтурЛогистика_КриптографияКлиентПовтИсп.ПолучитьТипыМодуляКриптографии();
	Для каждого ТипМодуля Из ТипыМодуляКриптографии Цикл
		Элементы.ТипПрограммыЭП.СписокВыбора.Добавить(ТипМодуля.ИмяМодуляКриптографии, );	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТипПрограммыЭППриОткрытии()
	
	ТипыМодуляКриптографии = КонтурЛогистика_КриптографияКлиентПовтИсп.ПолучитьТипыМодуляКриптографии();
	Для каждого ТипМодуля Из ТипыМодуляКриптографии Цикл
		
		Если ТипМодуля.ТипМодуляКриптографии = Запись.ТипМодуляКриптографии 
			И ТипМодуля.ИмяМодуляКриптографии = Запись.ИмяМодуляКриптографии Тогда
			
			ТипПрограммыЭП = ТипМодуля.ИмяМодуляКриптографии;			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ТипПрограммыЭПОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТипыМодуляКриптографии = КонтурЛогистика_КриптографияКлиентПовтИсп.ПолучитьТипыМодуляКриптографии();
	Для каждого ТипМодуля Из ТипыМодуляКриптографии Цикл
		
		Если ТипМодуля.ИмяМодуляКриптографии = ВыбранноеЗначение Тогда
			
			Запись.ТипМодуляКриптографии = ТипМодуля.ТипМодуляКриптографии;
			Запись.ИмяМодуляКриптографии = ТипМодуля.ИмяМодуляКриптографии;
			
			Элементы.ПредупреждениеГруппа.Видимость = Истина;
			Элементы.Предупреждение.Заголовок = "После выбора сертификата рекомендуется выполнить проверку сертификата";
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТипПрограммыЭППоУмолчанию()
	
	Если Запись.ТипМодуляКриптографии = 0 И ПустаяСтрока(Запись.ИмяМодуляКриптографии) Тогда
		
		ТипПрограммыЭППоУмолчанию = КонтурЛогистика_КриптографияКлиентПовтИсп.ПолучитьТипыМодуляКриптографии()[0];
		ТипПрограммыЭП = ТипПрограммыЭППоУмолчанию.ИмяМодуляКриптографии;
		Запись.ТипМодуляКриптографии = ТипПрограммыЭППоУмолчанию.ТипМодуляКриптографии;
		Запись.ИмяМодуляКриптографии = ТипПрограммыЭППоУмолчанию.ИмяМодуляКриптографии;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСертификат(Команда)
	
	Если ПустаяСтрока(ТипПрограммыЭП) Тогда
		Сообщить("Тип программы ЭП не выбран!");
		Возврат;
	КонецЕсли;
	
	Если Запись.СертификатНаСервере Тогда
		
		Попытка
			
			ПроверитьСертификатНаСервере();
			
			Оповещение = Новый ОписаниеОповещения("ПоказатьПредупреждениеЗавершение", ЭтаФорма);
			ПоказатьПредупреждение(Оповещение, "Проверка пройдена успешно!");
			
			ПроверкаПройдена = Истина;
			ТекстПредупреждения = "Проверка пройдена";
			
			УправлениеЭлементамиФормы(ЭтаФорма);
			
		Исключение
			
			Оповещение = Новый ОписаниеОповещения("ПоказатьПредупреждениеЗавершение", ЭтаФорма);	
			ВывестиОшибку(Оповещение, ИнформацияОбОшибке());
			
		КонецПопытки
		
	Иначе
		
		Оповещение = Новый ОписаниеОповещения("РасширениеРаботыСКриптографиейПодключено", ЭтаФорма);	
		НачатьПодключениеРасширенияРаботыСКриптографией(Оповещение);
		
	КонецЕсли;
	
КонецПроцедуры

&Насервере
Процедура ПроверитьСертификатНаСервере()
		
	МенеджерКриптографии = КонтурЛогистика_КриптографияСервер.ИнициализироватьМенеджерКриптографии(, Запись.ТипМодуляКриптографии);
			
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ИмяФайла = Строка(Новый УникальныйИдентификатор) + ".txt";
	ИмяПромежуточногоФайла = КаталогВременныхФайлов() + "\" + ИмяФайла;
	ТекстовыйДокумент.Записать(ИмяПромежуточногоФайла);
	
	ДвоичныеДанные = Новый ДвоичныеДанные(ИмяПромежуточногоФайла);
				
	КонтурЛогистика_КриптографияСервер.ПодписатьДанные(ДвоичныеДанные, 
															Запись.ОтпечатокСертификата, 
															Запись.ПЗК, 
															Запись.ТипМодуляКриптографии);		
	
КонецПроцедуры

&НаКлиенте
Процедура РасширениеРаботыСКриптографиейПодключено(Подключено, ДополнительныеПараметры) Экспорт
 
	Если НЕ Подключено Тогда
	 
		НачатьУстановкуРасширенияРаботыСКриптографией(Неопределено);
		Возврат;
		  
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("РасширениеРаботыСФайламиПодключено", ЭтаФорма);	
	НачатьПодключениеРасширенияРаботыСФайлами(Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура РасширениеРаботыСФайламиПодключено(Подключено, ДополнительныеПараметры) Экспорт
 
	Если НЕ Подключено Тогда
	 
		НачатьУстановкуРасширенияРаботыСФайлами(Неопределено);
		Возврат;
		  
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ТипМодуля", Запись.ТипМодуляКриптографии);
	ДополнительныеПараметры.Вставить("ИмяМодуля", Запись.ИмяМодуляКриптографии);
	
	Оповещение = Новый ОписаниеОповещения("НачатьИнициализациюМенеджераКриптографииЗавершение", ЭтаФорма, ДополнительныеПараметры,
											"НачатьИнициализациюМенеджераКриптографииОшибка", ЭтаФорма);	
	КонтурЛогистика_КриптографияКлиент.НачатьИнициализациюМенеджераКриптографии(Оповещение, 
																				Запись.ТипМодуляКриптографии, 
																				Запись.ИмяМодуляКриптографии, 
																				Запись.ВводитьПарольВПрограммеЭлектроннойПодписи);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьИнициализациюМенеджераКриптографииЗавершение(МенеджерКриптографии, ДополнительныеПараметры) Экспорт
	
	ПолучениеКаталогаВременныхФайлов(ДополнительныеПараметры);	
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьИнициализациюМенеджераКриптографииОшибка(ИнформацияОбОшибке, СтандартнаяОбработка, ДополнительныеПараметры) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("ПоказатьПредупреждениеЗавершение", ЭтаФорма);
	ВывестиОшибку(Оповещение, ИнформацияОбОшибке);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПредупреждениеЗавершение(ДополнительныеПараметры) Экспорт
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучениеКаталогаВременныхФайлов(ДополнительныеПараметры)      
	
	Оповещение = Новый ОписаниеОповещения("НачатьПолучениеКаталогаВременныхФайловЗавершение", ЭтаФорма, ДополнительныеПараметры);	
	НачатьПолучениеКаталогаВременныхФайлов(Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура НачатьПолучениеКаталогаВременныхФайловЗавершение(ИмяКаталогаВременныхФайлов, ДополнительныеПараметры) Экспорт

	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ИмяФайла = Строка(Новый УникальныйИдентификатор) + ".txt";
	ИмяПромежуточногоФайла = ИмяКаталогаВременныхФайлов + "\" + ИмяФайла;
	ТекстовыйДокумент.Записать(ИмяПромежуточногоФайла);
	
	ДополнительныеПараметры.Вставить("ИмяПромежуточногоФайла", ИмяПромежуточногоФайла);
	
	Оповещение = Новый ОписаниеОповещения("НачатьСозданиеДвоичныхДанныхИзФайлаЗавершение", ЭтаФорма, ДополнительныеПараметры);	
	НачатьСозданиеДвоичныхДанныхИзФайла(Оповещение, ИмяПромежуточногоФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьСозданиеДвоичныхДанныхИзФайлаЗавершение(ДвоичныеДанные, ДополнительныеПараметры) Экспорт
	
	ТипМодуля =  ДополнительныеПараметры.ТипМодуля;
	ИмяМодуля =  ДополнительныеПараметры.ИмяМодуля;
	
	Оповещение = Новый ОписаниеОповещения("ПроверкаПодписиЗавершение", ЭтаФорма, ДополнительныеПараметры, "ПроверкаПодписиЗавершениеОшибка", ЭтаФорма);
	КонтурЛогистика_КриптографияКлиент.ПодписатьАсинхронно(Оповещение, ДвоичныеДанные, Запись.ОтпечатокСертификата, 
															ТипМодуля, ИмяМодуля, Запись.ПЗК,
															Запись.ВводитьПарольВПрограммеЭлектроннойПодписи);
		
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаПодписиЗавершение(ДанныеПодписи, ДополнительныеПараметры) Экспорт
	
	Оповещение = Новый ОписаниеОповещения("ПоказатьПредупреждениеЗавершение", ЭтаФорма);
	ПоказатьПредупреждение(Оповещение, "Проверка пройдена успешно!");
	Элементы.ПредупреждениеГруппа.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаПодписиЗавершениеОшибка(ИнформацияОбОшибке, СтандартнаяОбработка, ДополнительныеПараметры) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("ПоказатьПредупреждениеЗавершение", ЭтаФорма);
	
	ВывестиОшибку(Оповещение, ИнформацияОбОшибке);
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиОшибку(Оповещение, ИнформацияОбОшибке)
	
	ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
	ПоказатьПредупреждение(Оповещение, ТекстОшибки);

КонецПроцедуры

&НаКлиенте
Процедура НачатьУдалениеФайловЗавершение(ДополнительныеПараметры) Экспорт	

КонецПроцедуры

&НаКлиенте
Процедура ВводитьПарольВПрограммеЭлектроннойПодписиПриИзменении(Элемент)
	
	УсловноеОформлениеПредставленияПЗК(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область МЧД

&НаСервере
Процедура ПроверитьМЧДНаСервере()
	
	PowerOfAttorneyPrevalidateResult = КонтурЛогистика_API_Диадок.Диадок_АПИ_PrevalidatePowerOfAttorney(Запись.ОрганизацияДиадок.ID, Запись.МЧД, Запись.Сертификат);
		
	ЗаписатьПротоколВалидации(PowerOfAttorneyPrevalidateResult);
	
	Если PowerOfAttorneyPrevalidateResult.Свойство("Статус404") Или ЕстьОшибкаВОтвете(PowerOfAttorneyPrevalidateResult, "PowerOfAttorneyNotFound", "PoaNotFound") Тогда
		
		Если ЗначениеЗаполнено(Запись.taskIdRegisterPOA) Тогда
			
			PowerOfAttorneyRegisterResult = КонтурЛогистика_API_Диадок.Диадок_АПИ_RegisterPowerOfAttorneyResult(Запись.ОрганизацияДиадок.ID, Запись.taskIdRegisterPOA);
			
			Если PowerOfAttorneyRegisterResult.OperationStatus = "Done" Тогда
				
				ОшибкаРегистрации = Ложь;
				
				PowerOfAttorneyPrevalidateResult = КонтурЛогистика_API_Диадок.Диадок_АПИ_PrevalidatePowerOfAttorney(Запись.ОрганизацияДиадок.ID, Запись.МЧД, Запись.Сертификат);
				Если PowerOfAttorneyPrevalidateResult.Свойство("PrevalidateStatus") Тогда
					ОбработатьОтветПроверкиМЧД(PowerOfAttorneyPrevalidateResult);
				КонецЕсли;
				
			Иначе
				
				ОшибкаРегистрации = Истина;
				ЗаполнитьОшибкиРегистрацииМЧД(PowerOfAttorneyRegisterResult);
				
			КонецЕсли;
			
		Иначе
		
			AsyncMethodResult = КонтурЛогистика_API_Диадок.Диадок_АПИ_RegisterPowerOfAttorney(Запись.ОрганизацияДиадок, Запись.МЧД);
			
			Если AsyncMethodResult.Свойство("taskId") Тогда
				
				Запись.taskIdRegisterPOA = AsyncMethodResult.taskId;				
				Записать();
				
				PowerOfAttorneyRegisterResult = КонтурЛогистика_API_Диадок.Диадок_АПИ_RegisterPowerOfAttorneyResult(Запись.ОрганизацияДиадок.ID, AsyncMethodResult.taskId);
				
				Если PowerOfAttorneyRegisterResult.OperationStatus = "Done" Тогда
					
					ОшибкаРегистрации = Ложь;
					
					PowerOfAttorneyPrevalidateResult = КонтурЛогистика_API_Диадок.Диадок_АПИ_PrevalidatePowerOfAttorney(Запись.ОрганизацияДиадок.ID, Запись.МЧД, Запись.Сертификат);
					Если PowerOfAttorneyPrevalidateResult.Свойство("PrevalidateStatus") Тогда
						ОбработатьОтветПроверкиМЧД(PowerOfAttorneyPrevalidateResult);
					КонецЕсли;
					
				Иначе
					
					ОшибкаРегистрации = Истина;
					ЗаполнитьОшибкиРегистрацииМЧД(PowerOfAttorneyRegisterResult);
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
	
	ИначеЕсли PowerOfAttorneyPrevalidateResult.Свойство("PrevalidateStatus") Тогда
		
		ОбработатьОтветПроверкиМЧД(PowerOfAttorneyPrevalidateResult);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПротоколВалидации(Ответ)
	
	Попытка
	    
		Если Ответ.Свойство("PrevalidateStatus")
			И Ответ.PrevalidateStatus.Свойство("ValidationProtocol")
			И Ответ.PrevalidateStatus.ValidationProtocol.Свойство("CheckResults") Тогда	    		
			Запись.ПротоколВалидации = КонтурЛогистика_МашиночитаемыеДовернностиСервер.ПротоколВалидацииВСтроку(Ответ.PrevalidateStatus.ValidationProtocol.CheckResults);		
		Иначе		
			Запись.ПротоколВалидации = "";		
		КонецЕсли;
		
	Исключение
		
		ИнформацияОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Сообщить("Ошибка чтения протокола валидации. " + ИнформацияОбОшибке);
		
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция ЕстьОшибкаВОтвете(Ответ, КодОшибки, КодОшибки2 = "")
	
	Если Ответ.Свойство("PrevalidateStatus") Тогда
	
		Если Ответ.PrevalidateStatus.Свойство("ValidationProtocol") Тогда   
			
			Ошибки = КонтурЛогистика_МашиночитаемыеДовернностиСервер.МассивОшибкиИзПротоколаВалидации(Ответ.PrevalidateStatus.ValidationProtocol);
			
			Для каждого Error Из Ошибки Цикл
				
				Если ЕстьОшибкаВСтруктуре(Error, КодОшибки, КодОшибки2) Тогда
					Возврат Истина;
				КонецЕсли;
				
			КонецЦикла;
					
		ИначеЕсли Ответ.PrevalidateStatus.Свойство("OperationError") Тогда
			
			OperationError = Ответ.PrevalidateStatus.OperationError;
			
			Если ЕстьОшибкаВСтруктуре(OperationError, КодОшибки, КодОшибки2) Тогда
				Возврат Истина;
			КонецЕсли;
			 					
		ИначеЕсли Ответ.PrevalidateStatus.Свойство("Errors") Тогда
			
			Для каждого Error Из Ответ.PrevalidateStatus.Errors Цикл
				
				Если ЕстьОшибкаВСтруктуре(Error, КодОшибки, КодОшибки2) Тогда
					Возврат Истина;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Функция ЕстьОшибкаВСтруктуре(СтруктураОшибки, КодОшибки, КодОшибки2 = "")
	
	Если СтруктураОшибки.Свойство("Code") И СтруктураОшибки.Code = КодОшибки Тогда
		Возврат Истина;
	ИначеЕсли СтруктураОшибки.Свойство("Text") И ЗначениеЗаполнено(КодОшибки2) И Найти(СтруктураОшибки.Text, КодОшибки2) > 0 Тогда
		Возврат Истина;		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьОшибкиРегистрацииМЧД(PowerOfAttorneyRegisterResult)
	
	Запись.ТекстСтатусаПроверки = КонтурЛогистика_МашиночитаемыеДовернностиСервер.ОписаниеСтатусаВыполненияРегистрации(PowerOfAttorneyRegisterResult.OperationStatus);
	
	Если ЗначениеЗаполнено(Запись.taskIdRegisterPOA) Тогда
		Запись.ТекстСтатусаПроверки = Запись.ТекстСтатусаПроверки + ". Идентификатор регистрации taskId: " + Запись.taskIdRegisterPOA;	
	КонецЕсли;
	
	Запись.СтатусПроверки = "IsNotValid";
	
	Если PowerOfAttorneyRegisterResult.Свойство("Errors") Тогда 
		Запись.ОшибкиПроверки = КонтурЛогистика_МашиночитаемыеДовернностиСервер.МассивОшибокВСтроку(PowerOfAttorneyRegisterResult.Errors);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьОтветПроверкиМЧД(PowerOfAttorneyPrevalidateResult)
	
	Если PowerOfAttorneyPrevalidateResult.PrevalidateStatus.Свойство("StatusText") Тогда
		Запись.ТекстСтатусаПроверки = PowerOfAttorneyPrevalidateResult.PrevalidateStatus.StatusText;	
	КонецЕсли;
	Если PowerOfAttorneyPrevalidateResult.PrevalidateStatus.Свойство("StatusNamedId") Тогда
		Запись.СтатусПроверки = PowerOfAttorneyPrevalidateResult.PrevalidateStatus.StatusNamedId;			
	КонецЕсли;
	
	Запись.ДатаПроверки = ТекущаяДатаСеанса();
	
	Запись.ОшибкиПроверки = КонтурЛогистика_МашиночитаемыеДовернностиСервер.ОшибкиПроверкиМЧД(PowerOfAttorneyPrevalidateResult);
			
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьМЧД(Команда)
	
	Если Не ЗначениеЗаполнено(Запись.Сертификат) Тогда
		Сообщить("Сертификат не выбран!");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Запись.МЧД) Тогда
		Сообщить("МЧД не выбрана!");
		Возврат;
	КонецЕсли;
	
	Попытка
		ПроверитьМЧДНаСервере();
	Исключение
		ИдентификаторДоверенности = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта_КонтурЛогистика(
			Запись.МЧД, "ИдентификаторДоверенности");
		ДопИнформация = Новый Структура;
		Если ЗначениеЗаполнено(ИдентификаторДоверенности) Тогда
			ДопИнформация.Вставить("IdМЧД", ИдентификаторДоверенности);
		КонецЕсли;
		
		КонтурЛогистика_Метрика.ОбработатьОшибку("ПроверитьМЧДНаСервере",
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()), Запись.МЧД, ДопИнформация);
	КонецПопытки;
	
	ОтобразитьГруппуПроверкиМЧД();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьГруппуПроверкиМЧД()

	Если (Запись.СтатусПодписанта = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыПодписанта._2")
			ИЛИ Запись.СтатусПодписанта = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыПодписанта._5")
			ИЛИ Запись.СпосПодтПолном = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СпособыПодтвержденияПолномочий._3"))
	Тогда
	
		Элементы.ГруппаПроверкаМЧД.Видимость = Не Запись.МЧД.Пустая();
		
		КолвоДнейПроверкиМЧД =КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.КоличествоДнейДляПредупрежденияПроверкиМЧД();
		МЧДВалидна = КонтурЛогистика_МашиночитаемыеДовернностиСервер.МЧДВалидна(Запись.СтатусПроверки);
		Если ЗначениеЗаполнено(Запись.МЧД) И МЧДВалидна И РазницаВДнях() > КолвоДнейПроверкиМЧД Тогда
			ОписаниеСтатусаПроверки = "Проверка МЧД не выполнялась более "
													+ Строка(КолвоДнейПроверкиМЧД) + " дней"
													+ Формат(Запись.ДатаПроверки, "ДФ=' (на дд.ММ.гггг ЧЧ:мм:сс)'");
			Элементы.КартинкаПроверкаМЧДУспешно.Видимость = Ложь;
			Элементы.КартинкаПроверкаМЧДНеУспешно.Видимость = Истина;
			Элементы.ПроверитьМЧД.Заголовок = "Перепроверить";
			Элементы.ГруппаПроверкаМЧД.ЦветФона = Новый Цвет(255, 236, 139);
			Элементы.ОписаниеСтатусаПроверки.ЦветРамки = Новый Цвет(255, 236, 139);
			Элементы.ОписаниеСтатусаПроверки.ЦветФона = Новый Цвет(255, 236, 139);			
		ИначеЕсли Не ЗначениеЗаполнено(Запись.СтатусПроверки) Тогда
			ОписаниеСтатусаПроверки = "Проверка не выполнялась";
			Элементы.КартинкаПроверкаМЧДУспешно.Видимость = Ложь;
			Элементы.КартинкаПроверкаМЧДНеУспешно.Видимость = Истина;
			Элементы.ПроверитьМЧД.Заголовок = "Проверить";
			Элементы.ГруппаПроверкаМЧД.ЦветФона = Новый Цвет(255, 236, 139);
			Элементы.ОписаниеСтатусаПроверки.ЦветРамки = Новый Цвет(255, 236, 139);
			Элементы.ОписаниеСтатусаПроверки.ЦветФона = Новый Цвет(255, 236, 139);			
		ИначеЕсли МЧДВалидна Тогда
			ОписаниеСтатусаПроверки = СокрЛП(Запись.ТекстСтатусаПроверки) + Формат(Запись.ДатаПроверки, "ДФ=' (на дд.ММ.гггг ЧЧ:мм:сс)'");
			Элементы.КартинкаПроверкаМЧДУспешно.Видимость = Истина;
			Элементы.КартинкаПроверкаМЧДНеУспешно.Видимость = Ложь;
			Элементы.ПроверитьМЧД.Заголовок = "Перепроверить";
			Элементы.ГруппаПроверкаМЧД.ЦветФона = Новый Цвет(144, 238, 144);
			Элементы.ОписаниеСтатусаПроверки.ЦветРамки = Новый Цвет(144, 238, 144);
			Элементы.ОписаниеСтатусаПроверки.ЦветФона = Новый Цвет(144, 238, 144);			
		Иначе
			ОписаниеСтатусаПроверки = СокрЛП(Запись.ТекстСтатусаПроверки) + Формат(Запись.ДатаПроверки, "ДФ=' (на дд.ММ.гггг ЧЧ:мм:сс)'");
			Элементы.КартинкаПроверкаМЧДУспешно.Видимость = Ложь;
			Элементы.КартинкаПроверкаМЧДНеУспешно.Видимость = Истина;
			Элементы.ПроверитьМЧД.Заголовок = "Перепроверить";
			Элементы.ГруппаПроверкаМЧД.ЦветФона = Новый Цвет(255, 236, 139);
			Элементы.ОписаниеСтатусаПроверки.ЦветРамки = Новый Цвет(255, 236, 139);
			Элементы.ОписаниеСтатусаПроверки.ЦветФона = Новый Цвет(255, 236, 139);			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Запись.ОшибкиПроверки) Тогда
			Элементы.ГруппаОшибкиПроверкиМЧД.Видимость = Истина;
			ОшибкиПроверки = КонтурЛогистика_МашиночитаемыеДовернностиСервер.ПредставлениеОшибокПроверкиМЧД(Запись.ОшибкиПроверки);
			Элементы.РешениеОшибки.Видимость = ОшибкаРегистрации;
		Иначе
			Элементы.ГруппаОшибкиПроверкиМЧД.Видимость = Ложь;
			Элементы.ОписаниеСтатусаПроверки.МногострочныйРежим = Ложь;
		КонецЕсли;
		
	Иначе
		
		Элементы.ГруппаПроверкаМЧД.Видимость = Ложь;
				
	КонецЕсли;
	
	 Элементы.ФормаОткрытьПротоколВалидации.Видимость = ЗначениеЗаполнено(Запись.ПротоколВалидации) И Не Запись.МЧД.Пустая();
	 
КонецПроцедуры

&НаСервере
Функция РазницаВДнях()
	
	Возврат КонтурЛогистика_ОбщегоНазначенияКлиентСервер.РазницаВДнях(ТекущаяДатаСеанса(), Запись.ДатаПроверки);
	
КонецФункции

&НаКлиенте
Процедура МЧД1ПриИзменении(Элемент)
	
	ОчиститьРеквизитыПроверкиМЧД();
	
	ОтобразитьГруппуПроверкиМЧД();
	
	ВалидацияМЧД();
	УправлениеОтображениемВалидацииМЧД();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьРеквизитыПроверкиМЧД()

	Запись.ДатаПроверки = "";
	Запись.СтатусПроверки = "";
	Запись.ТекстСтатусаПроверки = "";
	Запись.ОшибкиПроверки = "";	

КонецПроцедуры

&НаКлиенте
Процедура МЧД1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
			
	СтандартнаяОбработка = Ложь;
	
	Если Не ЗначениеЗаполнено(Запись.ОрганизацияДиадок) Тогда
		Сообщить("Не выбрана Организация (Диадок)");
		Возврат;
	КонецЕсли;
	
	НастройкиКД = Новый НастройкиКомпоновкиДанных;
	
	СписокОрганизацийДД = СписокОрганизацийДляОтбора(Запись.ОрганизацияДиадок);
	
	ОтборСписка = НастройкиКД.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ОтборСписка.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ИсходныйДоверитель");
    ОтборСписка.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
    ОтборСписка.ПравоеЗначение = СписокОрганизацийДД;
    ОтборСписка.Использование = Истина;
	
    ОтборСписка = НастройкиКД.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ОтборСписка.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДатаОкончания");
    ОтборСписка.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
    ОтборСписка.ПравоеЗначение = ТекущаяДата();
    ОтборСписка.Использование = Истина;
	
	ОтборСписка = НастройкиКД.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ОтборСписка.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПометкаУдаления");
    ОтборСписка.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
    ОтборСписка.ПравоеЗначение = Ложь;
    ОтборСписка.Использование = Истина;
	
	ОтборСписка = НастройкиКД.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ОтборСписка.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Наша");
    ОтборСписка.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
    ОтборСписка.ПравоеЗначение = Истина;
    ОтборСписка.Использование = Истина;
	
	ПараметрыВыбора = Новый Структура;
	ПараметрыВыбора.Вставить("ФиксированныеНастройки", НастройкиКД);

	ОткрытьФорму("Справочник.КонтурЛогистика_МЧД.ФормаВыбора", ПараметрыВыбора, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Функция СписокОрганизацийДляОтбора(ОрганизацияДиадок)
	Возврат Справочники.КонтурЛогистика_ОрганизацииДиадок.СписокОрганизацийПоИНН(ОрганизацияДиадок.ИНН);	
КонецФункции

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.КонтурЛогистика_МЧД") Тогда
	
		Запись.МЧД = ВыбранноеЗначение;
		
		ОчиститьРеквизитыПроверкиМЧД(); 	
		ОтобразитьГруппуПроверкиМЧД();
		ВалидацияМЧД();
		УправлениеОтображениемВалидацииМЧД();
		
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.КонтурЛогистика_СертификатыЭлектроннойПодписи") Тогда
		
		Запись.Сертификат = ВыбранноеЗначение;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияДиадокПриИзменении(Элемент)
	
	Запись.МЧД = "";
	Запись.ПротоколВалидации = "";
	
	ОчиститьРеквизитыПроверкиМЧД();	
	ОтобразитьГруппуПроверкиМЧД();
	
	ВалидацияМЧД();	
	УправлениеЭлементамиФормы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СпосПодтПолном1ПриИзменении(Элемент)
	УправлениеЭлементамиФормы(ЭтаФорма)
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОшибкиВалидации(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Текст", ОшибкиВалидации);
			
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"ОбщаяФорма.КонтурЛогистика_ФормаТекстовогоСообщения",
		ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПротоколВалидации(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОрганизацияДиадок", Запись.ОрганизацияДиадок);
	ПараметрыФормы.Вставить("Сертификат", Запись.Сертификат);
	ПараметрыФормы.Вставить("МЧД", Запись.МЧД);
	ПараметрыФормы.Вставить("ПротоколВалидации", Запись.ПротоколВалидации);
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("РегистрСведений.КонтурЛогистика_НастройкиПодписания.Форма.ФормаПротоколаВалидации", ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти
